var i,t,l = (/*'δεύτερος'+*/',δευτερόλεπτα,' +
'λεπτό,λεπτά,' +
'ώρα,ώρες,' +
'μέρα,μέρες,' +
'εβδομάδα,εβδομάδες,' +
'μήνα,μήνες,' +
'χρόνο,χρόνια').split(',');
for(i in l) l[i] = (t = (i&1?'%s ':'1 ')+l[i], [t+' πριν','σε '+t]);
l[0] = ['μόλις τώρα', 'σε λίγο'];
/*
['μόλις τώρα', 'σε λίγο'],
['%s δευτερόλεπτα πριν', 'σε %s δευτερόλεπτα'],
['1 λεπτό πριν', 'σε 1 λεπτό'],
['%s λεπτά πριν', 'σε %s λεπτά'],
['1 ώρα πριν', 'σε 1 ώρα'],
['%s ώρες πριν', 'σε %s ώρες'],
['1 μέρα πριν', 'σε 1 μέρα'],
['%s μέρες πριν', 'σε %s μέρες'],
['1 εβδομάδα πριν', 'σε 1 εβδομάδα'],
['%s εβδομάδες πριν', 'σε %s εβδομάδες'],
['1 μήνα πριν', 'σε 1 μήνα'],
['%s μήνες πριν', 'σε %s μήνες'],
['1 χρόνο πριν', 'σε 1 χρόνο'],
['%s χρόνια πριν', 'σε %s χρόνια']
*/
module.exports = function(number, index) {
  return l[index];
};
