var i=6,t,l = 'ثانیه,دقیقه,ساعت,روز,هفته,ماه,سال'.split(',');
for(; i>=0; i--) l[i*2+1] = l[i*2] = l[i];
for(i in l) l[i] = (t = (i&1?'%s ':'1 ')+l[i], [t+' پیش','حدود '+t+' پیش']);
l[0] = ['همین الآن', 'لحظاتی پیش'];
/*
['همین الآن', 'لحظاتی پیش'],
['%s ثانیه پیش', 'حدود %s ثانیه پیش'],
['1 دقیقه پیش', 'حدود 1 دقیقه پیش'],
['%s دقیقه پیش', 'حدود %s دقیقه پیش'],
['1 ساعت پیش', 'حدود 1 ساعت پیش'],
['%s ساعت پیش', 'حدود %s ساعت پیش'],
['1 روز پیش', 'حدود 1 روز پیش'],
['%s روز پیش', 'حدود %s روز پیش'],
['1 هفته پیش', 'حدود 1 هفته پیش'],
['%s هفته پیش', 'حدود %s هفته پیش'],
['1 ماه پیش', 'حدود 1 ماه پیش'],
['%s ماه پیش', 'حدود %s ماه پیش'],
['1 سال پیش', 'حدود 1 سال پیش'],
['%s سال پیش', 'حدود %s سال پیش']
*/
module.exports = function(number, index) {
  return l[index];
}
