var i,t,l = (',שניות,' +
'דקה,דקות,' +
'שעה,שעות,' +
',ימים,' +
'שבוע,שבועות,' +
'חודש,חודשים,' +
'שנה,שנים').split(',');
for(i in l) l[i] = (t = (i&1?' %s ':' ')+l[i], ['לפני'+t,'בעוד'+t]);
l[0] = ['זה עתה', 'עכשיו'];
l[6] = ['אתמול', 'מחר'];
/*
['זה עתה', 'עכשיו'],
['לפני %s שניות', 'בעוד %s שניות'],
['לפני דקה', 'בעוד דקה'],
['לפני %s דקות', 'בעוד %s דקות'],
['לפני שעה', 'בעוד שעה'],
['לפני %s שעות', 'בעוד %s שעות'],
['אתמול', 'מחר'],
['לפני %s ימים', 'בעוד %s ימים'],
['לפני שבוע', 'בעוד שבוע'],
['לפני %s שבועות', 'בעוד %s שבועות'],
['לפני חודש', 'בעוד חודש'],
['לפני %s חודשים', 'בעוד %s חודשים'],
['לפני שנה', 'בעוד שנה'],
['לפני %s שנים', 'בעוד %s שנים']
*/
module.exports = function(number, index) {
    return l[index];
};
