var i=0,t,l = (',,' +
'সেকেন্ড,এর সেকেন্ডের মধ্যে,' +
'মিনিট,মিনিটে,' +
'এর মিনিট,এর মিনিটের মধ্যে,' +
'ঘন্টা,ঘন্টা,' +
'ঘণ্টা,এর ঘন্টার মধ্যে,' +
'দিন,দিনের মধ্যে,' +
'এর দিন,এর দিন,' +
'সপ্তাহ,সপ্তাহের মধ্যে,' +
'এর সপ্তাহ,সপ্তাহের মধ্যে,' +
'মাস,মাসে,' +
'মাস,মাসে,' +
'বছর,বছরের মধ্যে,' +
'বছর,বছরে').split(',');
for(i in l) l[i/2] = (t = ((i/2)&1?'%s ':'1 '), [t+l[i]+' আগে',t+l[++i]]);
l[0] = [ 'এইমাত্র' , 'একটা সময়'];
/*
[ 'এইমাত্র' , 'একটা সময়'] ,
[ '%s সেকেন্ড আগে', '%s এর সেকেন্ডের মধ্যে'] ,
[ '1 মিনিট আগে', '1 মিনিটে'] ,
[ '%s এর মিনিট আগে', '%s এর মিনিটের মধ্যে'] ,
[ '1 ঘন্টা আগে', '1 ঘন্টা'] ,
[ '%s ঘণ্টা আগে', '%s এর ঘন্টার মধ্যে'] ,
[ '1 দিন আগে', '1 দিনের মধ্যে'] ,
[ '%s এর দিন আগে', '%s এর দিন'] ,
[ '1 সপ্তাহ আগে', '1 সপ্তাহের মধ্যে'] ,
[ '%s এর সপ্তাহ আগে', '%s সপ্তাহের মধ্যে'] ,
[ '1 মাস আগে', '1 মাসে'] ,
[ '%s মাস আগে', '%s মাসে'] ,
[ '1 বছর আগে', '1 বছরের মধ্যে'] ,
[ '%s বছর আগে', '%s বছরে']
*/
module.exports = function(number, index) {
  return l[index];
};
