var i=6,t,l = '秒,分,時間,日,週間,ヶ月,年'.split(',');
for(; i>=0; i--) l[i*2+1] = l[i*2] = l[i];
for(i in l) l[i] = (t = (i&1?'%s':'1')+l[i], [t+'前',t+'以内']);
l[0] = ['すこし前', 'すぐに'];
/*
['すこし前', 'すぐに'],
['%s秒前', '%s秒以内'],
['1分前', '1分以内'],
['%s分前', '%s分以内'],
['1時間前', '1時間以内'],
['%s時間前', '%s時間以内'],
['1日前', '1日以内'],
['%s日前', '%s日以内'],
['1週間前', '1週間以内'],
['%s週間前', '%s週間以内'],
['1ヶ月前', '1ヶ月以内'],
['%sヶ月前', '%sヶ月以内'],
['1年前', '1年以内'],
['%s年前', '%s年以内']
*/
module.exports = function(number, index) {
  return l[index];
};
