var i=1,t,l = [
  ['ഇപ്പോള്‍', 'കുറച്ചു മുന്‍പ്'],
  ['സെക്കന്റ്‌കള്‍ക്ക്', 'സെക്കന്റില്‍'],
  ['മിനിറ്റിനു', 'മിനിറ്റില്‍'],
  ['മിനിറ്റുകള്‍ക്ക്', 'മിനിറ്റില്‍'],
  ['മണിക്കൂറിനു', 'മണിക്കൂറില്‍'],
  ['മണിക്കൂറുകള്‍ക്കു', 'മണിക്കൂറില്‍'],
  ['ഒരു ദിവസം', 'ദിവസത്തില്‍'],
  ['ദിവസങ്ങള്‍ക്', 'ദിവസങ്ങള്‍ക്കുള്ളില്‍'],
  ['ആഴ്ച', 'ആഴ്ചയില്‍'],
  ['ആഴ്ചകള്‍ക്ക്', 'ആഴ്ചകള്‍ക്കുള്ളില്‍'],
  ['മാസത്തിനു', 'മാസത്തിനുള്ളില്‍'],
  ['മാസങ്ങള്‍ക്ക്', 'മാസങ്ങള്‍ക്കുള്ളില്‍'],
  ['വര്‍ഷത്തിനു ', 'വര്‍ഷത്തിനുള്ളില്‍'],
  ['വര്‍ഷങ്ങള്‍ക്കു', 'വര്‍ഷങ്ങള്‍ക്കുല്ല്ളില്‍']
];
for(; i<14;) l[i] = (t = (i&1?'%s ':'1 '), [t+l[i][0]+(i==3?' മുന്‍പ':' മുന്‍പ്'), t+l[i++][1]]);
/*
['ഇപ്പോള്‍', 'കുറച്ചു മുന്‍പ്'],
['%s സെക്കന്റ്‌കള്‍ക്ക് മുന്‍പ്', '%s സെക്കന്റില്‍'],
['1 മിനിറ്റിനു മുന്‍പ്', '1 മിനിറ്റില്‍'],
['%s മിനിറ്റുകള്‍ക്ക് മുന്‍പ', '%s മിനിറ്റില്‍'],
['1 മണിക്കൂറിനു മുന്‍പ്', '1 മണിക്കൂറില്‍'],
['%s മണിക്കൂറുകള്‍ക്കു മുന്‍പ്', '%s മണിക്കൂറില്‍'],
['1 ഒരു ദിവസം മുന്‍പ്', '1 ദിവസത്തില്‍'],
['%s ദിവസങ്ങള്‍ക് മുന്‍പ്', '%s ദിവസങ്ങള്‍ക്കുള്ളില്‍'],
['1 ആഴ്ച മുന്‍പ്', '1 ആഴ്ചയില്‍'],
['%s ആഴ്ചകള്‍ക്ക് മുന്‍പ്', '%s ആഴ്ചകള്‍ക്കുള്ളില്‍'],
['1 മാസത്തിനു മുന്‍പ്', '1 മാസത്തിനുള്ളില്‍'],
['%s മാസങ്ങള്‍ക്ക് മുന്‍പ്', '%s മാസങ്ങള്‍ക്കുള്ളില്‍'],
['1 വര്‍ഷത്തിനു  മുന്‍പ്', '1 വര്‍ഷത്തിനുള്ളില്‍'],
['%s വര്‍ഷങ്ങള്‍ക്കു മുന്‍പ്', '%s വര്‍ഷങ്ങള്‍ക്കുല്ല്ളില്‍']
*/
module.exports = function(number, index) {
  return l[index];
};
