var i=1,t,l = [
  ['ഇപ്പോള്‍', 'കുറച്ചു മുന്‍പ്'],
  ['സെക്കന്റ്‌കള്‍ക്ക്', 'സെക്കന്റില്‍'],
  ['മിനിറ്റിനു', 'മിനിറ്റില്‍'],
  ['മിനിറ്റുകള്‍ക്ക്', 'മിനിറ്റില്‍'],
  ['മണിക്കൂറിനു', 'മണിക്കൂറില്‍'],
  ['മണിക്കൂറുകള്‍ക്കു', 'മണിക്കൂറില്‍'],
  ['ഒരു ദിവസം', 'ദിവസത്തില്‍'],
  ['ദിവസങ്ങള്‍ക്', 'ദിവസങ്ങള്‍ക്കുള്ളില്‍'],
  ['ആഴ്ച', 'ആഴ്ചയില്‍'],
  ['ആഴ്ചകള്‍ക്ക്', 'ആഴ്ചകള്‍ക്കുള്ളില്‍'],
  ['മാസത്തിനു', 'മാസത്തിനുള്ളില്‍'],
  ['മാസങ്ങള്‍ക്ക്', 'മാസങ്ങള്‍ക്കുള്ളില്‍'],
  ['വര്‍ഷത്തിനു ', 'വര്‍ഷത്തിനുള്ളില്‍'],
  ['വര്‍ഷങ്ങള്‍ക്കു', 'വര്‍ഷങ്ങള്‍ക്കുല്ല്ളില്‍']
];
for(; i<14;) l[i] = (t = (i&1?'%s ':'1 '), [t+l[i][0]+(i==3?' മുന്‍പ':' മുന്‍പ്'), t+l[i++][1]]);
module.exports = function(number, index) {
  return l[index];
};
