var i,t,l = (
'секунду,секунду,секунды,секунд,' +
'минуту,минуту,минуты,минут,' +
'час,час,часа,часов,' +
'день,день,дня,дней,' +
'неделю,неделю,недели,недель,' +
'месяц,месяц,месяца,месяцев,' +
'год,год,года,лет').split(',');
for(i in l) l[i] = (t = (i%4?'%s ':'')+l[i], [t+' назад','через '+t]);
/*
['секунду назад', 'через секунду'],
['%s секунду назад', 'через %s секунду'],
['%s секунды назад', 'через %s секунды'],
['%s секунд назад', 'через %s секунд'],
['минуту назад', 'через минуту'],
['%s минуту назад', 'через %s минуту'],
['%s минуты назад', 'через %s минуты'],
['%s минут назад', 'через %s минут'],
['час назад', 'через час'],
['%s час назад', 'через %s час'],
['%s часа назад', 'через %s часа'],
['%s часов назад', 'через %s часов'],
['день назад', 'через день'],
['%s день назад', 'через %s день'],
['%s дня назад', 'через %s дня'],
['%s дней назад', 'через %s дней'],
['неделю назад', 'через неделю'],
['%s неделю назад', 'через %s неделю'],
['%s недели назад', 'через %s недели'],
['%s недель назад', 'через %s недель'],
['месяц назад', 'через месяц'],
['%s месяц назад', 'через %s месяц'],
['%s месяца назад', 'через %s месяца'],
['%s месяцев назад', 'через %s месяцев'],
['год назад', 'через год'],
['%s год назад', 'через %s год'],
['%s года назад', 'через %s года'],
['%s лет назад', 'через %s лет']
*/

// 28 and 29 stored for 2 hacks to keep compatibility with not packed version
l[28] = l[0]; // old version expects [секунду назад,через секунду] instead of [только что,через несколько секунд] for (1,1)
l[29] = l[12]; // old version expects [день назад,через день] instead of [вчера, завтра] for (1,7)
l[0] = ['только что', 'через несколько секунд'];
l[12] = ['вчера', 'завтра'];
module.exports = function(number, index) {
  return l[
  (!index || index === 6) ? ~~(index/2)*4 : (~~(index/2)*4 + ((number === 1)
  ? 
  // * hack:
    (index === 1 ? 28 /* to get 28 */ : (index === 7 ? 17 /* to get 29 */ : 
  // end of hack
    0
  // * hack:
    ))
  // end of hack
  : ((number%10 === 1 && number > 20)
  ? 1
  : ((number%10 > 1 && number%10 < 5 && (number > 20 || number < 10))
  ? 2
  : 3
  ))))];
};
